Revit 2017 API
AppearanceAssetElement.GetAppearanceAssetElementByName Method
 Gets an AppearanceAssetElement by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public static AppearanceAssetElement GetAppearanceAssetElementByName(
	Document doc,
	string name
)
Visual Basic
Public Shared Function GetAppearanceAssetElementByName ( _
	doc As Document, _
	name As String _
) As AppearanceAssetElement
Visual C++
public:
static AppearanceAssetElement^ GetAppearanceAssetElementByName(
	Document^ doc,
	String^ name
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 Document containing the AppearanceAssetElement.
name
Type: System.String
 Name of the AppearanceAssetElement.
Remarks
 Returns NULL is there is no AppearanceAssetElement with the specified name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace